{
  "_id": "1",
  "title": "Martians to use MongoDB",
  "author": "andrew",
  "body": "Representatives from the planet Mars announced today that the planet would adopt MongoDB as a planetary standard. Head Martian Flipblip said that MongoDB was the perfect tool to store the diversity of life that exists on Mars.",
  "usersWhoLiked":["andrew"],
  "usersWhoDisliked":[],
  "comments": [{"author": "andrew", "body": "first comment", "date":  ISODate("2013-03-11T01:54:53.692Z")},
                {"author": "maria", "body": "second comment", "date":  ISODate("2015-03-11T01:54:53.692Z")},
                {"author": "john", "body": "3rd comment", "date":  ISODate("2015-03-12T01:54:53.692Z")},
                {"author": "boby", "body": "4th comment", "date":  ISODate("2015-03-13T01:54:53.692Z")},
                {"author": "andrew 55", "body": "5th comment", "date":  ISODate("2015-03-14T01:54:53.692Z")},
                {"author": "andrew 64", "body": "6th comment", "date":  ISODate("2015-03-15T01:54:53.692Z")}],
  "date": ISODate("2016-01-31T01:54:53.692Z")
}

{
  "_id": "2",
  "title": "Declaration of Independence",
  "author": "Maria Jones",
  "body": "When in the Course of human events, it becomes necessary for one people to dissolve the political bands which have connected them with another, and to assume among the powers of the earth, the separate and equal station to which the Laws of Nature and of Nature's God entitle them, a decent respect to the opinions of mankind requires that they should declare the causes which impel them to the separation.\nWe hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.\n\tThat to secure these rights, Governments are instituted among Men, deriving their just powers from the consent of the governed, That whenever any Form of Government becomes destructive of these ends, it is the Right of the People to alter or to abolish it, and to institute new Government, laying its foundation on such principles and organizing its powers in such form, as to them shall seem most likely to effect their Safety and Happiness. Prudence, indeed, will dictate that Governments long established should not be changed for light and transient causes; and accordingly all experience hath shewn, that mankind are more disposed to suffer, while evils are sufferable, than to right themselves by abolishing the forms to which they are accustomed. But when a long train of abuses and usurpations, pursuing invariably the same Object evinces a design to reduce them under absolute Despotism, it is their right, it is their duty, to throw off such Government, and to provide new Guards for their future security.\"\n",
  "usersWhoLiked":["Maria Jones", "andrew"],
  "usersWhoDisliked":[],
  "comments": [],
  "date": ISODate("2014-05-12T01:54:53.692Z")
}

{
  "_id": "3",
  "title": "Bill of Rights",
  "author": "Bill Smith",
  "body": "Amendment I\nCongress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof; or abridging the freedom of speech, or of the press; or the right of the people peaceably to assemble, and to petition the Government for a redress of grievances.\n\nAmendment II\nA well regulated Militia, being necessary to the security of a free State, the right of the people to keep and bear Arms, shall not be infringed.\n\nAmendment III\nNo Soldier shall, in time of peace be quartered in any house, without the consent of the Owner, nor in time of war, but in a manner to be prescribed by law.\n\nAmendment IV\nThe right of the people to be secure in their persons, houses, papers, and effects, against unreasonable searches and seizures, shall not be violated, and no Warrants shall issue, but upon probable cause, supported by Oath or affirmation, and particularly describing the place to be searched, and the persons or things to be seized.\n\nAmendment V\nNo person shall be held to answer for a capital, or otherwise infamous crime, unless on a presentment or indictment of a Grand Jury, except in cases arising in the land or naval forces, or in the Militia, when in actual service in time of War or public danger; nor shall any person be subject for the same offence to be twice put in jeopardy of life or limb; nor shall be compelled in any criminal case to be a witness against himself, nor be deprived of life, liberty, or property, without due process of law; nor shall private property be taken for public use, without just compensation.\n\nAmendment VI\nIn all criminal prosecutions, the accused shall enjoy the right to a speedy and public trial, by an impartial jury of the State and district wherein the crime shall have been committed, which district shall have been previously ascertained by law, and to be informed of the nature and cause of the accusation; to be confronted with the witnesses against him; to have compulsory process for obtaining witnesses in his favor, and to have the Assistance of Counsel for his defence.\n\nAmendment VII\nIn Suits at common law, where the value in controversy shall exceed twenty dollars, the right of trial by jury shall be preserved, and no fact tried by a jury, shall be otherwise re-examined in any Court of the United States, than according to the rules of the common law.\n\nAmendment VIII\nExcessive bail shall not be required, nor excessive fines imposed, nor cruel and unusual punishments inflicted.\n\nAmendment IX\nThe enumeration in the Constitution, of certain rights, shall not be construed to deny or disparage others retained by the people.\n\nAmendment X\nThe powers not delegated to the United States by the Constitution, nor prohibited by it to the States, are reserved to the States respectively, or to the people.\"\n\n",
  "usersWhoLiked":["Maria Jones", "andrew"],
  "usersWhoDisliked":[],
  "comments": [],
  "date": ISODate("2011-06-12T01:54:53.692Z")
}

{
  "_id": "4",
  "title": "Gettysburg Address",
  "author": "Bill Smith",
  "body": "Four score and seven years ago our fathers brought forth on this continent a new nation, conceived in liberty, and dedicated to the proposition that all men are created equal.<p>Now we are engaged in a great civil war, testing whether that nation, or any nation, so conceived and so dedicated, can long endure. We are met on a great battle-field of that war. We have come to dedicate a portion of that field, as a final resting place for those who here gave their lives that that nation might live. It is altogether fitting and proper that we should do this.<p>But, in a larger sense, we can not dedicate, we can not consecrate, we can not hallow this ground.",
  "usersWhoLiked":[],
  "usersWhoDisliked":[],
  "comments": [],
  "date": ISODate("2015-06-12T01:54:53.692Z")
}

{
  "_id": "5",
  "title": "Refactoring - book review",
  "author": "Oliver Queen",
  "body": "It doesn't matter if your IDE has refactoring capabilities built-in. You deserve yourself reading this one so you can refactor your code more effectively, but even more important: why and when you should (or shouldn't) refactor.\n\nI'd practiced Object-Oriented programming for 10 years before reading this book, only to find out that I didn't understand it even a little bit. This book was a real eye-opener.\n\nAnd while you're reading through it, you'll also learn about good OOD too!\n\nInstant classic!",
  "usersWhoLiked":["Maria Jones", "andrew"],
  "usersWhoDisliked":[],
  "comments": [],
  "date": ISODate("2015-12-26T01:54:53.692Z")
}

{
  "_id": "6",
  "title": "Refactoring - a simple book review",
  "author": "Felicity Smoak",
  "body": "Like many other books of Martin Fowler, easy to read and easy to follow. Though a bit too simple to reflect the complicated nature of refactoring and how decision should be made (but the example in the first chapter is great). The language used in the book is Java, making it quite less practical for a user of dynamic languages like me.",
  "usersWhoLiked":["Maria Jones"],
  "usersWhoDisliked":[],
  "comments": [],
  "date": ISODate("2016-01-26T01:54:53.692Z")
}